Repository: RegaloOmar/TheGlobalGuide
Catalog: TheGlobalGuide/Features/Utils/Localizable/Localizable.xcstrings
Source language: en
Languages: es_419

source: 🗺️ All
es_419: 🗺️ Todos

source: Connection Error
es_419: Error de Conexión

source: Explore
es_419: Explorar

source: Explore the World!
es_419: Explora el mundo!

source: Favorites
es_419: Favoritos

source: Geographic Information
es_419: Información Geográfica

source: Get ready to explore....
es_419: Preparate para explorar

source: Location
es_419: Localización

source: Location data not available
es_419: No hay datos de localización

source: My Favorites
es_419: Mis Favoritos

source: Region
es_419: Región

source: Search a country
es_419: Busca un país

source: Try Again
es_419: Reintentar

source: What you need to know
es_419: Que necesitas saber

source: Your Album is empty :(
es_419: Tu álbum está vacío :(

source: Your favorites will be here...when you select it :)
es_419: Aqui se mostraran tus favoritos… cuando selecciones unos :)
